[M_CordiallyInvited MissionDefinition]
MissionDescription="Tiny Tina's got a tea party coming up in [place]Tundra Express[-place], and she needs you to find her date: Sir Reginald Von Bartlesby. She believes he's being held captive by his mother. She'll also need you to get some fixin's for the tea party -- buzzard shrapnel, crumpets, and the like."
MissionSummary="Get supplies for Tina's tea party. "

[M_CordiallyInvited02 MissionDefinition]
MissionDescription="Tiny Tina wants to throw a tea party in [place]Tundra Express[-place], but she's missing the guest of honor. She needs you to find him and lure him to her place. To attract Flesh-Stick, you'll need to shoot at him every once in a while. Keep him angry enough to follow you, but don't kill him."
TurnInDescription="Flesh-Stick's abduction brings to mind an old Pandoran saying: ''Welcome to the party, pal.''"
MissionSummary="Lure Flesh-Stick to Tina's party. "

[M_CordiallyInvited:PlacetheItemsSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Tiny Tina's got a tea party coming up in [place]Tundra Express[-place]. Because you are awesome, you found everything Tina asked of you. Now you just need to head back to Tina's and set everything up. "
